; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared1 - mode
	infrared0 - mode
	image2 - mode
	image3 - mode
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Planet21 - direction
	Star22 - direction
	Star23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
	Phenomenon26 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star22)
	(supports instrument2 image2)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument4 image2)
	(supports instrument4 image3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared0)
	(supports instrument5 image2)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared0)
	(supports instrument6 image3)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet16)
	(supports instrument7 image2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
)
(:goal (and
	(pointing satellite1 Star22)
	(have_image Planet5 image3)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared0)
	(have_image Planet9 image3)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Star13 image2)
	(have_image Planet14 infrared1)
	(have_image Planet16 image3)
	(have_image Star17 image3)
	(have_image Planet18 image2)
	(have_image Star20 infrared0)
	(have_image Planet21 infrared0)
	(have_image Star22 image2)
	(have_image Star23 image3)
	(have_image Phenomenon24 infrared0)
	(have_image Phenomenon25 image3)
	(have_image Phenomenon26 image2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 20
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 20
3. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 20
4. (turn_to satellite3 groundstation4 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 20
5. (calibrate satellite3 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 1 of 20
6. (turn_to satellite3 phenomenon24 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon24)
   goals met: 1 of 20
7. (take_image satellite3 phenomenon24 instrument5 infrared0)
   added: (have_image phenomenon24 infrared0)
   goals met: 2 of 20
8. (turn_to satellite3 phenomenon25 phenomenon24)
   deleted: (pointing satellite3 phenomenon24)
   added: (pointing satellite3 phenomenon25)
   goals met: 2 of 20
9. (take_image satellite3 phenomenon25 instrument5 image3)
   added: (have_image phenomenon25 image3)
   goals met: 3 of 20
10. (turn_to satellite3 phenomenon26 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 phenomenon26)
   goals met: 3 of 20
11. (take_image satellite3 phenomenon26 instrument5 image2)
   added: (have_image phenomenon26 image2)
   goals met: 4 of 20
12. (turn_to satellite3 phenomenon6 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 phenomenon6)
   goals met: 4 of 20
13. (take_image satellite3 phenomenon6 instrument5 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 5 of 20
14. (turn_to satellite3 planet16 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet16)
   goals met: 5 of 20
15. (take_image satellite3 planet16 instrument5 image3)
   added: (have_image planet16 image3)
   goals met: 6 of 20
16. (turn_to satellite3 planet18 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet18)
   goals met: 6 of 20
17. (take_image satellite3 planet18 instrument5 image2)
   added: (have_image planet18 image2)
   goals met: 7 of 20
18. (turn_to satellite3 planet21 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet21)
   goals met: 7 of 20
19. (take_image satellite3 planet21 instrument5 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 8 of 20
20. (turn_to satellite3 planet5 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 planet5)
   goals met: 8 of 20
21. (take_image satellite3 planet5 instrument5 image3)
   added: (have_image planet5 image3)
   goals met: 9 of 20
22. (turn_to satellite3 planet9 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet9)
   goals met: 9 of 20
23. (take_image satellite3 planet9 instrument5 image3)
   added: (have_image planet9 image3)
   goals met: 10 of 20
24. (turn_to satellite3 star13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star13)
   goals met: 10 of 20
25. (take_image satellite3 star13 instrument5 image2)
   added: (have_image star13 image2)
   goals met: 11 of 20
26. (turn_to satellite3 star17 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star17)
   goals met: 11 of 20
27. (take_image satellite3 star17 instrument5 image3)
   added: (have_image star17 image3)
   goals met: 12 of 20
28. (turn_to satellite3 star20 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 star20)
   goals met: 12 of 20
29. (take_image satellite3 star20 instrument5 infrared0)
   added: (have_image star20 infrared0)
   goals met: 13 of 20
30. (turn_to satellite3 star22 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 star22)
   goals met: 13 of 20
31. (take_image satellite3 star22 instrument5 image2)
   added: (have_image star22 image2)
   goals met: 14 of 20
32. (turn_to satellite3 star23 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 star23)
   goals met: 14 of 20
33. (take_image satellite3 star23 instrument5 image3)
   added: (have_image star23 image3)
   goals met: 15 of 20
34. (turn_to satellite3 star8 star23)
   deleted: (pointing satellite3 star23)
   added: (pointing satellite3 star8)
   goals met: 15 of 20
35. (take_image satellite3 star8 instrument5 infrared0)
   added: (have_image star8 infrared0)
   goals met: 16 of 20
36. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   goals met: 16 of 20
37. (calibrate satellite2 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 16 of 20
38. (turn_to satellite2 phenomenon12 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon12)
   goals met: 16 of 20
39. (take_image satellite2 phenomenon12 instrument2 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 17 of 20
40. (turn_to satellite2 phenomenon7 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon7)
   goals met: 17 of 20
41. (take_image satellite2 phenomenon7 instrument2 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 18 of 20
42. (turn_to satellite2 planet11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet11)
   goals met: 18 of 20
43. (take_image satellite2 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 19 of 20
44. (turn_to satellite2 planet14 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet14)
   goals met: 19 of 20
45. (take_image satellite2 planet14 instrument2 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 20 of 20
